// 'number' + 3 + 3
// 1. 'number' + 3: Рядок 'number' конкатенується з числом 3, результат рядок 'number3'
// 2. 'number3' + 3: Рядок 'number3' конкатенується з числом 3, результат 'number33'
'number' + 3 + 3;


// null + 3
// 1. null перетворюється в 0 js приводить до числа
// 2. 0 + 3 дорівнює 3.
null + 3;

// 5 && "qwerty"
// 1. Оператор && повертає другий операнд, якщо перший є істинним (truthy).
// 2. 5 є істинним, тому повертається "qwerty".
5 && "qwerty";

// +'40' + +'2' + "hillel";
// 1. +'40': плюс перетворює '40' на число 40
// 2. +'2': плюс перетворює '2' на число 2
// 3. 40 + 2: Ці числа додаються, отримуємо 42
// 4. 42 + "hillel": Число 42 конкатенується з рядком "hillel", вийде '42hillel'
+'40' + +'2' + "hillel";

// '10' - 5 === 6
// 1. '10' - 5: Рядок '10' перетворюється на число 10, результатом є 10 - 5, що дорівнює 5
// 2. 5 === 6: порівняння є false
'10' - 5 === 6; // false

// true + false
// 1. true перетворюється на 1, а false перетворюється на 0
// 2. 1 + 0 = 1
true + false; // 1

// '4px' - 3
// 1. '4px' не може бути перетворено на число, тому результат - NaN
'4px' - 3; // NaN

// '4' - 3
// 1. Рядок '4' перетворюється на число 4.
// 2. 4 - 3 дорівнює 1.
'4' - 3; // 1

// '6' + 3 ** 0;
// 1. 3 ** 0: Оператор піднесення до степеня дає результат 1 (будь-яке число в степені 0 дорівнює 1).
// 2. '6' + 1: Число 1 конкатенується з рядком '6', отримуємо '61'.
'6' + 3 ** 0; // '61'

// 12 / '6'
// 1. Рядок '6' перетворюється на число 6
// 2. 12 / 6 = 2
12 / '6'; // 2

// '10' + (5 === 6);
// 1. 5 === 6: Це порівняння є false
// 2. '10' + false: false стає рядком 'false', отримуємо '10false'
'10' + (5 === 6); // '10false'

// null == ''
// 1. null дорівнює лише undefined, але не пустому рядку
null == ''; // false

// 3 ** (9 / 3);
// 1. 9 / 3 равно 3
// 2. 3 ** 3 равно 27
3 ** (9 / 3); // 27

// !!'false' == !!'true'
// 1. !!'false': Рядок 'false' є істинним (truthy), тому !!'false' равно true
// 2. !!'true': Рядок 'true' є істинним (truthy), тому !!'true' равно true
// 3. true == true є істинним
!!'false' == !!'true'; // true

// 0 || '0' && 1
// 1. 0 || '0': 0 є хибним (falsy), тому повертається '0'
// 2. '0' && 1: '0' є істинним (truthy), тому повертається 1
0 || '0' && 1; // 1

// (+null == false) < 1;
// 1. +null: плюс перетворює null на 0.
// 2. 0 == false: false перетворюється на 0, тому це порівняння є true
// 3. true < 1: true перетворюється на 1, тому 1 < 1 є false
(+null == false) < 1; // false

// false && true || true
// 1. false && true: повертається false, оскільки перший операнд є хибним (falsy)
// 2. false || true: повертається true, оскільки перший операнд є хибним (falsy)
false && true || true; // true

// false && (false || true);
// 1. false || true: повертається true, оскільки другий операнд є істинним (truthy)
// 2. false && true: повертається false, оскільки перший операнд є хибним (falsy)
false && (false || true); // false

// (+null == false) < 1 ** 5;
// 1. +null: плюс перетворює null на 0
// 2. 0 == false: false перетворюється на 0, тому це порівняння є істинним
// 3. 1 ** 5: Оператор піднесення до степеня дає результат 1
// 4. true < 1: true перетворюється на 1, тому 1 < 1 є false
(+null == false) < 1 ** 5; // false